Documents/АР17_ИнформационныйДокумент.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>АР17_ИнформационныйДокумент</Name>
			<BasedOn>
				<xr:Item>Document.АР17_ЗаключениеДоговораАренды</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.АР_ПереданныеДокументы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Передан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Возвращен</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АР17_ЗаключениеДоговораАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АР_Москва</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АР_СанктПетербург</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АР_СтатусДоговора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Получатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>EMail</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОтправки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/АР_ПереданныеДокументы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>АР_ПереданныеДокументы</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПереданоЭкземпляров</Name>
					<Comment>Если остаток &lt;&gt; 0 , документы переданы не вернулись</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АР17_НачислениеАренднойПлаты</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
						<v8:Type>cfg:DocumentRef.АР17_ЗаключениеДоговораАренды</v8:Type>
						<v8:Type>cfg:DocumentRef.АР17_ИнформационныйДокумент</v8:Type>
						<v8:Type>cfg:DocumentRef.АР17_ДополнительноеСоглашение</v8:Type>
						<v8:Type>cfg:DocumentRef.АР17_РасторжениеДоговораАренды</v8:Type>
						<v8:Type>cfg:DocumentRef.АР17_СчетНаАренду</v8:Type>
						<v8:Type>cfg:DocumentRef.АР_АктПриемаВозвратаАрендуемогоПомещения</v8:Type>
						<v8:Type>cfg:DocumentRef.АР_АктПриемаПередачиПомещенияВАренду</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектАренды</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/АР17_ИнформационныйДокумент/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	Если ДанныеЗаполнения <> Неопределено И ТипДанныхЗаполнения <> Тип("Структура")
		И Метаданные().ВводитсяНаОсновании.Содержит(ДанныеЗаполнения.Метаданные()) Тогда
		//ДокументОснование = ДанныеЗаполнения;
		//ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДокументОснование,, "Дата, Номер, Проведен, ПометкаУдаления, Передан, Возвращен");
		ЭтотОбъект.ДокументОснование = ДанныеЗаполнения;
		ЭтотОбъект.ДоговорКонтрагента = ДанныеЗаполнения.ДоговорКонтрагента;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ЗначениеЗаполнено(ЭтотОбъект.Передан) и ЗначениеЗаполнено(ЭтотОбъект.Возвращен)
		или не ЗначениеЗаполнено(ЭтотОбъект.Передан) и не ЗначениеЗаполнено(ЭтотОбъект.Возвращен) 
		Тогда 
			НаборЗаписей = РегистрыНакопления.АР_ПереданныеДокументы.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
			НаборЗаписей.Очистить();
			НаборЗаписей.Записать();
	Иначе
	
		Если ЗначениеЗаполнено(ЭтотОбъект.Передан) Тогда
			ЭтотОбъект.Записать();
			НаборЗаписей = РегистрыНакопления.АР_ПереданныеДокументы.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
			Запись = НаборЗаписей.ДобавитьПриход();
			Запись.Период = ЭтотОбъект.Передан;
			Запись.Документ = ЭтотОбъект.Ссылка;
			Запись.ПереданоЭкземпляров = 1;
			НаборЗаписей.Записать();
		КонецЕсли;	
			
		Если ЗначениеЗаполнено(ЭтотОбъект.Возвращен) Тогда
			ЭтотОбъект.Записать();
			НаборЗаписей = РегистрыНакопления.АР_ПереданныеДокументы.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
			Запись = НаборЗаписей.ДобавитьРасход();
			Запись.Период = ЭтотОбъект.Возвращен;
			Запись.Документ = ЭтотОбъект.Ссылка;
			Запись.ПереданоЭкземпляров = 1;
			НаборЗаписей.Записать();
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Не ЗначениеЗаполнено(Номер) Тогда
		
		УстановитьНовыйНомер();
		
	КонецЕсли;
	
	АР_ОбщиеПроцедуры.УстановкаДатыПереданДокумента(ЭтотОбъект, РежимЗаписи);// + NAI Becar Конюшок С.Н. от 19.01.2017 17:21
	
	Если (Этотобъект.ПометкаУдаления) И (НЕ Ссылка.ПометкаУдаления) Тогда
        АР_ОбщиеПроцедуры.ОчиститьДвижения(ЭтотОбъект);
    КонецЕсли; 
	
КонецПроцедуры


Процедура ОбработкаУдаленияПроведения(Отказ)
	АР_ОбщиеПроцедуры.ОчиститьДвижения(ЭтотОбъект);
КонецПроцедуры
